Revit 2026 API

# ElectricalSystemApparentCurrentPhaseA Property

---

The ApparentCurrentPhaseA value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ApparentCurrentPhaseA { get; }
```
```vb
Public ReadOnly Property ApparentCurrentPhaseA As Double
	Get
```
```cpp
public:
property double ApparentCurrentPhaseA {
	double get ();
}
```
```fsharp
member ApparentCurrentPhaseA : float with get
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the ApparentCurrentPhaseA value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace